Catalogs/Кластеры1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Кластеры1С</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольСервераАдминистрирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортКластера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяАдминистратораКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольАдминистратораКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКластера</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Защищен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииПлатформы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеСерверыКластера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Кластеры1С/Forms/ФормаНовогоЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрукутараПараметров = Константы.ОбщиеПараметрыАутентификации.ПолучитьСтруктуруНастроекПоУмолчанию();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтрукутараПараметров, "ПользовательСервераАдминистрирования, ПарольСервераАдминистрирования"); 
	
	Если ПортСервераАдминистрирования = 0 Тогда 
		ПортСервераАдминистрирования = 1545;
	КонецЕсли;
	
	Элементы.ПанельВыбораКластера.Видимость		= Ложь;
	Элементы.РазделПараметровКластера.Видимость		= Ложь;
	Элементы.РазделИнформационныеБазы.Видимость	= Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяКАгенту(Команда)
	
	ПараметрыПодключения = Новый Структура("АдресСервераАдминистрирования, 
											|ПортСервераАдминистрирования,
											|ИмяАдминистратораКластера,
											|ПарольАдминистратораКластера");

	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, Объект);
	
	ЗаполнитьСписокКластеров(ПараметрыПодключения);
	
	СписокКластеров = Элементы.СписокКластеров.СписокВыбора;
	
	Если СписокКластеров.Количество() > 1 Тогда
		Для Каждого Кластер Из СписокКластеров Цикл
			Элементы.СписокКластеров.СписокВыбора = СписокКластеров;
		КонецЦикла;
		
		Элементы.ПанельВыбораКластера.Видимость = Истина;  
	ИначеЕсли СписокКластеров.Количество() = 1 Тогда
		//Получить
		Элементы.РазделПараметровКластера.Видимость = Истина;  
		
	Иначе
		ПоказатьПредупреждение(, "Для данного сервера администрирования все кластеры зарегестрированы");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКластеров(ПараметрыПодключения)
	
	
	//#REF Список должен состоять из Из соответствий всех необходимых параметров кластера
	
	МассивКластеров = ПолучитьМассивКластеров();
	
	СписокКластеров = Элементы.СписокКластеров.СписокВыбора;
	Для Каждого ЭлементМассива Из МассивКластеров Цикл
		Если Справочники.Кластеры1С.НайтиПоРеквизиту("ИдентификаторКластера", ЭлементМассива.ИдентификаторКластера) = Неопределено Тогда
			СписокКластеров.Добавить(ЭлементМассива.ИдентификаторКластера, ЭлементМассива.Имя);
		КонецЕсли;
	КонецЦикла;   
	
	Если СписокКластеров.Количество() = 1 Тогда   
		
		//#REF Сразу заполняем параметры кластера из соответсвия
		//ЗаполнитьПараметрыКластера(СписокКластеров[0].Значение);	
	КонецЕсли;

КонецПроцедуры // ПолучитьМассивКластеров()

&НаСервере
Процедура ЗаполнитьПараметрыКластера(ИдентификаторКластера)
	
	//#REF Отказаться от процедуры
	
	МассивКластеров = ПолучитьМассивКластеров();
	
	СписокКластеров = Новый СписокЗначений;
	Для Каждого ЭлементМассива Из МассивКластеров Цикл
		Если ЭлементМассива.ИдентификаторКластера = ИдентификаторКластера Тогда
			Кластер = ЭлементМассива;
			Прервать;
		КонецЕсли;
	КонецЦикла; 		
	
	Объект.Наименование			= Кластер.Имя;
	Объект.АдресКластера			= Кластер.ИмяКомпьютера;
	Объект.ПортКластера			= Кластер.Порт;
	Объект.ИдентификаторКластера	= Кластер.ИдентификаторКластера;
	
КонецПроцедуры // ЗаполнитьПараметрыКластера()

&НаСервере
Функция ПолучитьМассивКластеров()

	//#REF Использовать сразу объект.
	ПараметрыПодключения = Новый Структура("АдресСервераАдминистрирования, 
										|ПортСервераАдминистрирования,
										|ИмяАдминистратораКластера,
										|ПарольАдминистратораКластера");

	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, Объект);
	АгентАдминистрирования = АдминистрированиеСерверов.ПолучитьАгентаАдминистрированияКластера(ПараметрыПодключения);
	
	Возврат АгентАдминистрирования.ПолучитьКластеры();

КонецФункции // ПолучитьМассивКластеров()
  
&НаКлиенте
Процедура ВыбратьКластер(Команда)
	
	Элементы.ПанельВыбораКластера.ТолькоПросмотр = Истина;
	Элементы.РазделПараметровКластера.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяККластеру(Команда)

					
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьБазы(Команда)
	
	НачатьРегистрациюБазКластера();
	Оповестить("РегистрацияИнформационныхБаз", Объект.Ссылка);
	Закрыть();
	
КонецПроцедуры  

&НаСервере
Процедура НачатьРегистрациюБазКластера()
	
	Записать();
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.КлючФоновогоЗадания = Строка(Объект.Ссылка.УникальныйИдентификатор());
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Объект.ИдентификаторЗадания = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "Справочники.Кластеры1С.СоздатьБазыПоДаннымКластера", Объект.Ссылка);
	Записать();
	
КонецПроцедуры // НачатьРегистрациюБазКластера()

&НаКлиенте
Процедура СписокКластеровПриИзменении(Элемент)
	
	//ЗаполнитьПараметрыКластера(ИдентификаторКластера);		
	
КонецПроцедуры
